#Handling Missing Values

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math  science  mar  hin  total date
0  S0001      7         6    60       90   78   56     67  yes
1  S0002      5         4    90       60   67   78     76  yes
2  S0003      6         6    70       70   56   98     56   no
3  S0004      9         8    50       80   34   43     89  yes
4  S0005      3         5    50       80   89   53     76  yes
5  S0006      6         5    60       80   76   63     49   no
6  S0007      2         5    60       89   56   73     78   no

In [4]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math  science  mar   hin  total date
0  S0001      7       6.0    60     90.0   78  56.0   67.0  yes
1  S0002      5       4.0    90     60.0   67  78.0   76.0  yes
2  S0003      6       NaN    70     70.0   56  98.0    NaN   no
3    NaN      9       NaN    50      NaN   34   NaN   89.0  NaN
4  S0005      3       5.0    50      NaN   89  53.0   76.0  NaN
5  S0006      6       5.0    60     80.0   76  63.0   49.0   no
6  S0007      2       5.0    60     89.0   56  73.0   78.0  NaN

In [5]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

,id,class,sleep_hr,math,science,mar,hin,total,date
0,S0001,7,6.0,60,90,78,56.0,67.0,yes
1,S0002,5,4.0,90,60,67,78.0,76.0,yes
2,S0003,6,NaN,70,70,56,98.0,NaN,no
3,NaN,9,NaN,50,NaN,34,NaN,89.0,not available
4,S0005,3,5.0,50,not available,89,53.0,76.0,NaN
5,S0006,6,5.0,60,80,76,63.0,49.0,no
6,S0007,2,5.0,60,89,56,73.0,78.0,NaN

In [8]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math    science  mar   hin  total           date
0  S0001      7       6.0    60         90   78  56.0   67.0            yes
1  S0002      5       4.0    90         60   67  78.0   76.0            yes
2  S0003      6       NaN    70         70   56  98.0    NaN             no
3    NaN      9       NaN    50        NaN   34   NaN   89.0  not available
4  S0005      3       5.0    50  no values   89  53.0   76.0            NaN
5  S0006      6       5.0    60         80   76  63.0   49.0             no
6  S0007      2       5.0    60         89   56  73.0   78.0            NaN

#to change not available and no values to NaN...

In [10]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',na_values=['not available','no values'])
df

      id  class  sleep_hr  math  science  mar   hin  total date
0  S0001      7       6.0    60     90.0   78  56.0   67.0  yes
1  S0002      5       4.0    90     60.0   67  78.0   76.0  yes
2  S0003      6       NaN    70     70.0   56  98.0    NaN   no
3    NaN      9       NaN    50      NaN   34   NaN   89.0  NaN
4  S0005      3       5.0    50      NaN   89  53.0   76.0  NaN
5  S0006      6       5.0    60     80.0   76  63.0   49.0   no
6  S0007      2       5.0    60     89.0   56  73.0   78.0  NaN

#to change NaN for particular column..

In [11]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math    science  mar   hin  total           date
0  S0001      7       6.0    60         90   78  56.0   67.0            yes
1  S0002      5       4.0    90         60   67  78.0   76.0            yes
2  S0003      6       NaN    70         70   56  98.0    NaN             no
3    NaN      9       NaN    50        NaN   34   NaN   89.0  not available
4  S0005      3       5.0    50  no values   89  53.0   76.0            NaN
5  S0006      6       5.0    60         80   76  63.0   49.0             no
6  S0007      2       5.0    60         89   56  73.0   78.0            NaN

In [12]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',na_values={'science':'no values'})
df

      id  class  sleep_hr  math  science  mar   hin  total           date
0  S0001      7       6.0    60     90.0   78  56.0   67.0            yes
1  S0002      5       4.0    90     60.0   67  78.0   76.0            yes
2  S0003      6       NaN    70     70.0   56  98.0    NaN             no
3    NaN      9       NaN    50      NaN   34   NaN   89.0  not available
4  S0005      3       5.0    50      NaN   89  53.0   76.0            NaN
5  S0006      6       5.0    60     80.0   76  63.0   49.0             no
6  S0007      2       5.0    60     89.0   56  73.0   78.0            NaN

#To keep NaN values as default

In [13]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math    science  mar   hin  total date
0  S0001      7       6.0    60         90   78  56.0   67.0  yes
1  S0002      5       4.0    90         60   67  78.0   76.0  yes
2  S0003      6       NaN    70         70   56  98.0    NaN   no
3    NaN      9       NaN    50        NaN   34   NaN   89.0  NaN
4  S0005      3       5.0    50  no values   89  53.0   76.0  NaN
5  S0006      6       5.0    60         80   76  63.0   49.0   no
6  S0007      2       5.0    60         89   56  73.0   78.0  NaN

In [14]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',keep_default_na=False)
df

      id  class sleep_hr  math    science  mar hin total  date
0  S0001      7        6    60         90   78  56    67   yes
1  S0002      5        4    90         60   67  78    76   yes
2  S0003      6             70         70   56  98          no
3             9     NULL    50              34        89  null
4  S0005      3        5    50  no values   89  53    76  #N/A
5  S0006      6        5    60         80   76  63    49    no
6  S0007      2        5    60         89   56  73    78

In [15]:
#na_filter...to check out the missing values in dataframe

In [16]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math  science  mar  hin  total date
0  S0001      7         6    60       90   78   56     67  yes
1  S0002      5         4    90       60   67   78     76  yes
2  S0003      6         4    70       70   56   98     78   no
3  S0004      9         4    50       70   34   67     89   no
4  S0005      3         5    50       90   89   53     76  yes
5  S0006      6         5    60       80   76   63     49   no
6  S0007      2         5    60       89   56   73     78  yes

In [17]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',na_filter=False)
df

      id  class  sleep_hr  math  science  mar  hin  total date
0  S0001      7         6    60       90   78   56     67  yes
1  S0002      5         4    90       60   67   78     76  yes
2  S0003      6         4    70       70   56   98     78   no
3  S0004      9         4    50       70   34   67     89   no
4  S0005      3         5    50       90   89   53     76  yes
5  S0006      6         5    60       80   76   63     49   no
6  S0007      2         5    60       89   56   73     78  yes

In [18]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math  science  mar   hin  total date
0  S0001      7         6    60       90   78  56.0     67  yes
1  S0002      5         4    90       60   67  78.0     76  yes
2  S0003      6         4    70       70   56  98.0     78   no
3  S0004      9         4    50       70   34  67.0     89   no
4  S0005      3         5    50       90   89  53.0     76  yes
5  S0006      6         5    60       80   76   NaN     49   no
6  S0007      2         5    60       89   56  73.0     78  yes

In [19]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',na_filter=True)
df

      id  class  sleep_hr  math  science  mar   hin  total date
0  S0001      7         6    60       90   78  56.0     67  yes
1  S0002      5         4    90       60   67  78.0     76  yes
2  S0003      6         4    70       70   56  98.0     78   no
3  S0004      9         4    50       70   34  67.0     89   no
4  S0005      3         5    50       90   89  53.0     76  yes
5  S0006      6         5    60       80   76   NaN     49   no
6  S0007      2         5    60       89   56  73.0     78  yes

In [20]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',na_filter=False)
df

      id  class  sleep_hr  math  science  mar hin  total date
0  S0001      7         6    60       90   78  56     67  yes
1  S0002      5         4    90       60   67  78     76  yes
2  S0003      6         4    70       70   56  98     78   no
3  S0004      9         4    50       70   34  67     89   no
4  S0005      3         5    50       90   89  53     76  yes
5  S0006      6         5    60       80   76         49   no
6  S0007      2         5    60       89   56  73     78  yes